DataProcessors/Панель1СWebKassa.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>Панель1СWebKassa</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/НастройкиИнтеграцииWebKassa.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>НастройкиИнтеграцииWebKassa</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияWebKassa</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПользователя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник, соответствующий данному пользователю</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Омг_ВебКассаПользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Омг_ВебКассаПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/Панель1СWebKassa/Forms/АутентификацияПользователя/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ПредлагатьЗапомнитьПароль = Истина;
	Если Параметры.Свойство("ПредлагатьЗапомнитьПароль", ПредлагатьЗапомнитьПароль)
		И ПредлагатьЗапомнитьПароль = Ложь Тогда
		Элементы.ЗапомнитьПароль.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
		СписокДоступныхПользователей.ЗагрузитьЗначения(
			Справочники.НастройкиИнтеграцииWebKassa.ПользователиОрганизации(Параметры.Организация));
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////
	// ОМГ +   
	РезультатВозврата = ОМГ_ЗполнитьДанныеВебКасса();
	Если не РезультатВозврата = Неопределено Тогда
	//ЗаполнитьЗначенияСвойств(ЭтотОбъект,РезультатВозврата);
	ЭтотОбъект.Пользователь = РезультатВозврата.Пользователь;
	ЭтотОбъект.ПарольПользователя = РезультатВозврата.ПарольПользователя;	
	КонецЕсли;	

	// ОМГ +
	////////////////////////////////////////////////////////////////////////////////////////
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаГотово(Команда)
	
	Если ЗначениеЗаполнено(Пользователь) и ЗначениеЗаполнено(ПарольПользователя) Тогда
		ОМГ_СохранитьДанныеВебКасса(Пользователь,ПарольПользователя)
	КонецЕсли;

	КомандаГотовоВыполнить();
	
КонецПроцедуры 

&НаСервере
Процедура ОМГ_СохранитьДанныеВебКасса(Пользователь,ПарольПользователя)  
	
   	УстановитьПривилегированныйРежим(Истина);
	ПользовательТек = ПараметрыСеанса.ТекущийПользователь.ПолучитьОбъект() ;
	ПользовательТек.Омг_ВебКассаПользователь = Пользователь;
	ПользовательТек.Омг_ВебКассаПароль = ПарольПользователя;
	ПользовательТек.Записать(); 
    УстановитьПривилегированныйРежим(Ложь); 
	
КонецПроцедуры	  

&НаСервере
Функция ОМГ_ЗполнитьДанныеВебКасса()  
	
	УстановитьПривилегированныйРежим(Истина);

	РезультатВозврата = Неопределено;
	ПользовательТек = ПараметрыСеанса.ТекущийПользователь ;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Омг_ВебКассаПользователь КАК Пользователь,
	|	Пользователи.Омг_ВебКассаПароль КАК ПарольПользователя
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ПользовательТек);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Пользователь) и 
			ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПарольПользователя) Тогда 	
			
			РезультатВозврата = Новый Структура;	
			РезультатВозврата.Вставить("Пользователь",       ВыборкаДетальныеЗаписи.Пользователь);
			РезультатВозврата.Вставить("ПарольПользователя", ВыборкаДетальныеЗаписи.ПарольПользователя);		
			
		КонецЕсли;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат РезультатВозврата;
	
КонецФункции	

&НаКлиенте
Процедура КомандаГотовоВыполнить()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) И СписокДоступныхПользователей.НайтиПоЗначению(Пользователь) = Неопределено Тогда
		ШаблонСообщения = НСтр("ru = 'Пользователь %1 не имеет доступа к организации %2.
									|Обратитесь к администратору.'");
		
		ИнтеграцияWebKassaКлиентПереопределяемый.СообщитьПользователю(
			ИнтеграцияWebKassaКлиентПереопределяемый.ПодставитьПараметрыВСтроку(ШаблонСообщения, Пользователь, Организация));
		
		Возврат;
	КонецЕсли;
	
	РезультатВыбора = Новый Структура;
	
	РезультатВыбора.Вставить("Пользователь",       Пользователь);
	РезультатВыбора.Вставить("ПарольПользователя", ПарольПользователя);
	//РезультатВыбора.Вставить("ЗапомнитьПароль",    ЗапомнитьПарольНаВремяСеанса);
	
    ////////////////////////////////////////////////////////////////////////////////////////
	// ОМГ +  
	РезультатВыбора.Вставить("ЗапомнитьПароль",    Ложь);
	// ОМГ +
	////////////////////////////////////////////////////////////////////////////////////////
		
	Закрыть(РезультатВыбора);
	
КонецПроцедуры 
#КонецОбласти
